{
  "info": {
    "eventName": "QuarenTech",
    "year": 2020,
    "title": "QuarenTech | Conectando comunidades",
    "about": "Acreditamos que o conhecimento deve ser livre, plural e unir as mais diversas tribos. A partir disso pensamos em estreitar laços, unir ainda mais nossa comunidade. Assim nasceu a #QuarenTech. Quatro dias de live e muita energia sobre o nosso mundo. O universo da tecnologia que, nas últimas semanas, invadiu os lares para ser o principal motor de contato entre amigos, colegas de trabalho e familiares é o principal pilar do evento. A #QuarenTech, representada pelo raio que chega para balançar os dias de isolamento social, devido à COVID-19, é um evento de tecnologia sem fins lucrativos e organizado pelo curso de Sistemas para Internet, da Faculdade Ielusc. É preciso parar, refletir, ouvir o outro. A proposta desta primeira edição é estreitar a comunicação, fomentar o diálogo e colocar em discussão temas atuais como Saúde Mental, Comunidades, Experiência do Usuário, Agile e Tecnologia. Coloque na agenda, entre os dias 25 e 27 de maio, no nosso canal no YouTube.",
    "capacity": "Comunidades",
    "date": "25/05 a 27/05",
    "hour": "19:00 - 22:00",
    "place": "YouTube",
    "sponsor_link": "documento_de_patrocinio_devconf_2020.pdf",
    "address": "-",
    "tickets": {
      "available": true
    }
  },
  "sympla": {
    "id":"sympla-widget-791212",
    "script": "https://www.sympla.com.br/js/sympla.widget-pt.js/791212"
  },
  "schedule": [
    {
      "time": "19:00",
      "title": "25/05 | Segunda-Feira"
    },
    {
      "time": "Segunda - 19:00",
      "title": "Vamos falar de estados?",
      "details": "O objetivo da talk é mostrar o significado de estados no desenvolvimento de software. Vamos entender o que são estados e como utilizá-los em nossas aplicações",
      "speaker": {
        "name": "Fernando Daciuk",
        "company": "Lukin",
        "photo": "assets/img/ielusc_fernando-daciuk.jpeg",
        "priority": 1,
        "bio": "CTO e desenvolvedor web na Lukin Co. Professor na queroser.ninja. Dependente de JavaScript. Fã de React e Node.js.",
        "social": [
          { "type": "twitter", "url": "https://twitter.com/fdaciuk" },
          { "type": "linkedin", "url": "https://www.linkedin.com/in/fdaciuk/" },
          { "type": "github", "url": "https://github.com/fdaciuk" }
        ]
      }
    },
    {
      "time": "Segunda - 20:00",
      "title": "Microsserviços e Monólitos  em 2020",
      "details": "O estilo arquitetural baseado em microsserviços não é recente, tampouco software monolítico deixou de existir. A que se deve esse fato? Entenda o que são microsserviços e monólitos na visão moderna, prós e contras e como essas abordagens se complementam e devem ser utilizadas em conjunto na chamada “caixa de ferramentas” do profissional de TI",
      "speaker": {
        "name": "Samuel Grigolato",
        "company": "Rentbrella",
        "photo": "assets/img/ielusc_samuel.jpeg",
        "priority": 2,
        "bio": "Consultor de TI há 13 anos no mercado, já participou de projetos com arquitetura monolítica, baseada em microsserviços, e também uma mistura entre as duas. Atualmente é CTO da Rentbrella, aplicativo de compartilhamento de guarda-chuva com cerca de 400 estações operantes no Brasil, em processo de expansão internacional. Também compõe o corpo docente do curso Lato Sensu de desenvolvimento web da UFSCar.",
        "social": [
          { "type": "linkedin", "url": "https://www.linkedin.com/in/samuel-grigolato/" },
          { "type": "github", "url": "https://github.com/samuelgrigolato" }
        ]
      }
    },
    {
      "time": "Segunda - 21:00",
      "title": "Serverless: A revolução na nuvem",
      "details": "Mudança da mentalidade das pessoas em relação a reserva de recursos e como essa revolução começou com o cloud computing indo desde a IaaS ou Infrastructure as a Service, passando pela PaaS ou Platform as a Service para enfim chegar em FaaS ou Function as a Service. Vamos abordar as diferenças fundamentais entre esses modelos, onde se aplicam e porque o conceito de Serverless veio para mudar a forma como estruturamos a arquitetura das aplicações, abordando conceitos de Microservice e Nanoservice.",
      "speaker": {
        "name": "Rodrigo Branas",
        "company": "Gennera",
        "photo": "assets/img/ielusc_branas.jpeg",
        "priority": 3,
        "bio": "Rodrigo Branas é arquiteto de software, professor, autor e palestrante, especializado na linguagem JavaScript e com mais de 20 anos de experiência. Atualmente é CTO de uma empresa que desenvolve soluções para a área de educação, com mais de 1000 clientes em todo o país. Além disso, tem um canal no YouTube onde fala sobre Vue.js, Node, JavaScript, Testes, Microservices, API, HTTP, Rest, GraphQL e muito mais!",
        "social": [
          { "type": "linkedin", "url": "https://linkedin.com/in/rodrigobranas/" },
          { "type": "youtube", "url": "https://youtube.com/rodrigobranas"},
          { "type": "instagram", "url": "https://instagram.com/rodrigobranas/"},
          { "type": "twitter", "url": "https://twitter.com/rodrigobranas"}
        ]
      }
    },
    {
      "time": "19:00",
      "title": "26/05 | Terça-Feira"
    },
    {
      "time": "Terça - 19:00",
      "title": "Saúde mental: cuidados, estratégias e prevenções",
      "details": "Saúde mental no mercado de trabalho, especialmente no mercado de tecnologia. As abordagens devem focar nos cuidados, estratégias e prevenções a partir de uma perspectiva psicológica.",
      "speaker": {
        "name": "Bruna von Runkel",
        "company": "Psicologa",
        "photo": "assets/img/ielusc_bruna.png",
        "priority": 4,
        "bio": "Psicóloga, CRP - 12/16539, Especialista em Gestão estratégica de Pessoas pela PUC PR. Formação complementar em Orientação Profissional & Planejamento de Carreira. Mestranda em Psicologia na Univali. Coordenadora e Business Partner de RH na TOTVS, atua há mais de 11 anos neste segmento com desenvolvimento de lideranças e times ágeis. Instrutora de treinamentos organizacionais de lideranças, relações interpessoais e gestão de pessoas. Atua também como Consultora de Carreira e Orientadora Profissional em consultório particular.",
        "social": [
          { "type": "linkedin", "url": "https://www.linkedin.com/in/brunavonrunkel/" }
        ]
      }
    },
    {
      "time": "Terça - 20:00",
      "title": "DevOps & Site Reliability Engineering",
      "details": ".",
      "speaker": {
        "name": "Victor Bogo",
        "company": "Pier",
        "photo": "assets/img/ielusc_bogo.png",
        "priority": 4,
        "bio": "Working as a Software Engineer in the first years of my career made me get in touch with interesting tools and platforms. After some time, I started to realize that the SiteReliability Engineering responsibilities and practices were something that I would really appreciate to work with.",
        "social": [
          { "type": "linkedin", "url": "https://www.linkedin.com/in/victorbogo/" }
        ]
      }
    },
    {
      "time": "Terça - 21:00",
      "title": "Saúde Mental e Tecnologia da Informação: enfrentamentos possíveis",
      "details": "Conversa sobre Saúde Mental e seu impacto na auto-eficácia dos profissionais da Tecnologia da Informação durante sua atuação profissional e enfrentamento de situações cotidianas. Sugestão de técnicas de Mindfulness e Terapia Cognitivo-Comportamental.",
      "speaker": {
        "name": "Anne Caroline da Silva",
        "company": "Psicologa",
        "photo": "assets/img/ielusc_anne.png",
        "priority": 6,
        "bio": "Psicóloga especialista em Terapia Cognitivo-Comportamental pela UNIFIA e mestranda em Educação pela Univille. Atua na área clínica e coordena o Serviço de Psicologia da Univille.",
        "social": [
          { "type": "facebook", "url": "https://www.facebook.com/anne.css00" }
        ]
      }
    },
    {
      "time": "19:00",
      "title": "27/05 | Quarta-Feira"
    },
    {
      "time": "Quarta - 19:00",
      "title": "Porque e como usamos Go na Codenation",
      "details": "Nesta palestra vou fazer uma breve introdução a linguagem Go, suas vantagens e como fazemos uso delas para desenvolver o produto da Codenation, deste APIs, micro serviços, migrations, etc.",
      "speaker": {
        "name": "Elton Minetto",
        "company": "CodeNation",
        "photo": "assets/img/ielusc_elton2.jpg",
        "priority": 7,
        "bio": "Elton Minetto possui graduação e especialização em Ciência de Computação. É desenvolvedor de software com mais de 20 anos de experiência, professor, escritor e palestrante. Atualmente é CTO da Codenation e autor das newsletters A Semana Go e A Semana PHP.",
        "social": [
          { "type": "twitter", "url": "https://twitter.com/eminetto" },
          { "type": "linkedin", "url": "https://www.linkedin.com/in/eminetto/" },
          { "type": "github", "url": "https://github.com/eminetto" }
        ]
      }
    },
    {
      "time": "Quarta - 20:00",
      "title": "Ruby e Rails ainda são relevantes em 2020?",
      "details": "Nessa talk irei mostrar uma breve apresentação sobre a linguagem Ruby e o framework para Web Rails. Iremos ver e discutir sobre a relevância atual da linguagem em 2020 e o que o futuro aguarda.",
      "speaker": {
        "name": "Carlos Eduardo Ribeiro",
        "company": "DNSimple",
        "photo": "assets/img/ielusc_carlos.jpeg",
        "priority": 8,
        "bio": "Engenheiro de Software com skills no ecossistema Ruby, Java e Javascript. Tenho experiência em frameworks de desenvolvimento como Rails e Sinatra. Entusiasta de Design de API, arquitetura de software, cloud e CI/CD. Gosto de trabalhar com cloud, docker, OpenShift, Terraform, Ansible e outras ferramentas para entrega e gerenciamento do meu software.",
        "social": [
          { "type": "twitter", "url": "https://twitter.com/duduribeiro" },
          { "type": "linkedin", "url": "https://www.linkedin.com/in/carloseduribeiro"},
          { "type": "github", "url": "https://github.com/duduribeiro" }
        ]
      }
    },
    {
      "time": "Quarta - 21:00",
      "title": "Agilidade de alta performance, mito ou realidade?",
      "details": "Entenda como as Fintechs revolucionam o mercado através da agilidade em seus times.",
      "speaker": {
        "name": "Vaner Teixeira",
        "company": "PagSeguro",
        "photo": "assets/img/ielusc_vanerteixeira.jpg",
        "priority": 9,
        "bio": "Especialista em Transformação Ágil, Consultor em Processo, Projetos e Instrutor Agile. Trabalho transformando empresas, construindo parcerias e inovando através do desenvolvimento de produtos digitais que transformem o negócio e a vida das pessoas. Lema: Conhecimento é para ser compartilhado. Certificações Ágeis:  PACC®, PSPO®, PSM®, PSK® ",
        "social": [
          { "type": "twitter", "url": "https://twitter.com/vanerteixeira" },
          { "type": "linkedin", "url": "https://www.linkedin.com/in/vaner-teixeira/" }
        ]
      }
    },
    {
      "time": "19:00",
      "title": "28/05 - Quinta-Feira"
    },
    {
      "time": "Quinta - 19:00",
      "title": "UX design para encantar clientes e a busca do 'WOW effect'",
      "details": "Hoje as funcionalidades e questões técnicas muitas vezes não são suficientes para gerar a satisfação ou diferenciação desejada no meio de tantas alternativas que o mercado oferece.O UX design é uma metodologia que essencialmente consiste em conhecer a fundo as necessidades e limitações do seu usuário de maneira a entender como ele pensa e entregar uma solução que atenda perfeitamente a sua dor. Indo além disso, o chamado WOW effect é não apenas resolver uma dor mas também encantar e impressionar o cliente. Descubra por onde começar!",
      "speaker": {
        "name": "Priscilla Albuquerque",
        "company": "Catarinas Design",
        "photo": "assets/img/ielusc_priscilla.jpg",
        "priority": 10,
        "bio": " UX Strategist | Professora | Palestrante",
        "social": [
          { "type": "linkedin", "url": "https://www.linkedin.com/in/priscillaalbuquerque/" }
        ]
      }
    },
    {
      "time": "Quinta - 20:00 ",
        "title": "iOS in 2020: State of the Art",
        "details": "O que está acontecendo na comunidade iOS? Quais são os tópicos mais falados nos últimos tempos? Vamos falar um pouquinho de cada um desses temas, indo de monorepos e clean architecture a SwiftUI e combine.",
        "speaker": {
          "name": "Yasmin Benatti",
          "company": "iFood",
          "photo": "assets/img/2020_yasmin.jpg",
          "priority":11,
          "bio": "Yasmin Benatti é dev iOS no time de Mobile Platform no iFood, é host do MovileCast e dos meetups Movile Tech Women e Cocoaheads Campinas. Apaixonada por diversidade, decoração de interiores, DIY e cafés coados.",
          "social": [
            { "type": "twitter", "url": "http://twitter.com/minbenatti" },
            { "type": "linkedin", "url": "https://www.linkedin.com/in/yasminbenatti/" },
            { "type": "github", "url": "https://github.com/yabenatti" }
          ]
        }
      },
    {
      "time": "Quinta - 21:00",
      "title": " From Zero to Hero",
      "details": "Já se sentiu perdida na carreira, sem saber como arrumar um primeiro (ou outro) trampo em tech? Já achou que não sabe nada? Já achou que não cumpre nada dos requisitos de determinada vaga? Já se perguntou o quê empresas buscam em potenciais canditadas e o quê você pode fazer para ser tudo o que elas buscam? Se você respondeu sim pra pelo menos uma das perguntas, essa palestra é pra você! Veremos o olhar de uma dev sobre como funciona o processo de contratação, com direito a algumas dicas do que fazer pra se preparar para eles!",
      "speaker": {
        "name": "Camila Campos",
        "company": "Creditas",
        "photo": "assets/img/2018_camila_campos.jpg",
        "priority": 12,
        "bio": "Formada em Sistemas de Informação na EACH-USP, Camila Campos é a chata dos testes e do código bonito que trabalha como engenheira de software na Creditas e organiza o Rails Girls São Paulo e o Women Dev Summit.",
        "social": [
          { "type": "twitter", "url": "https://twitter.com/camposmilaa" },
          { "type": "linkedin", "url": "https://www.linkedin.com/in/camposmilaa/" },
          { "type": "github", "url": "https://github.com/camilacampos" }
        ]
      }
    },
    {
      "time": "Quinta - 22:00",
      "title": "Ferramentas Open Source da Microsoft",
      "details": "Nesta palestra iremos ter um overview do github, github actions com azure, vscode, typescript, linux no windows entre outras magias fantásticas no universo microsoft open source.",
      "speaker": {
        "name": "Loiane Groner",
        "company": "Citi",
        "photo": "assets/img/ielusc_loiane2.jpg",
        "priority": 13,
        "bio": "Loiane Groner possui 14 anos de experiência em TI, trabalha como engenheira de software e analista de negócios nos Estados Unidos e ama compartilhar  conhecimento! Palestrante internacional, é autora de livros publicados mundialmente. É Google Developer Expert, Microsoft MVP, Oracle Groundbreaker Ambassador e Java Champion. Escreve para o blog http://loiane.com e publica aulas e cursos em http://loiane.training.",
        "social": [
          { "type": "twitter", "url": "https://twitter.com/loiane" },
          { "type": "linkedin", "url": "https://www.linkedin.com/in/loiane/" },
          { "type": "github", "url": "https://github.com/loiane" }
        ]
      }
    }
  ],
  "workshop_schedule": {
  },
  "pastEditions": [
    {
      "title": "DevConf 2019",
      "link": "http://2019.devconf.com.br/"
    },
    {
      "title": "DevConf 2018",
      "link": "http://2018.devconf.com.br/"
    },
    {
      "title": "DevConf 2017",
      "link": "http://2017.devconf.com.br/"
    }
  ],
  "sponsors": {
  },
  "partners": [
  ]
}
